content/posts/20210705173431-hugo.md
+++
title = "Hugo"
tags = ["tool"]
draft = false
+++

To blog with plain text


## Emacs {#emacs}

Integrated with [Emacs]({{< relref "20200530210833-emacs.md" >}}) by [ox-hugo](https://ox-hugo.scripter.co/)

```elisp
(use-package ox-hugo
  :ensure t            ;Auto-install the package from Melpa
  :after ox)
```

Root directory of the source for the Hugo site:

-   `HUGO_BASE_DIR`
-   `#+hugo_base_dir:` keyword in org file


## Markdown Processors {#markdown-processors}

-   Blackfriday (default)
-   Mmark


## LaTeX {#latex}

Support for LaTeX math equations is added by rendering engine:

-   KaTeX
-   MathJax


## Partials {#partials}

Support is added by creating partials inside `layouts/partials/`
Partials are activated with:

```text
---
katex: true
markup: "mmark"
---
```


## Installation and Usage {#installation-and-usage}

-   [Installing](https://gohugo.io/getting-started/installing/)
    -   `sudo pacman -Syu hugo`

-   [Quick Start](https://gohugo.io/getting-started/quick-start/)
    -   `hugo new site quickstart`
    -   Theming
        -   <https://themes.gohugo.io>
        -   <https://github.com/gohugoio/hugoThemes>
        -   <https://themes.gohugo.io/>
        -   then add the theme to `config.toml`

<!--listend-->

```bash
cd quickstart
git init
git submodule add https://github.com/theNewDynamic/gohugo-theme.git
```

-   Starting the server
    -   `hugo server -D`
    -   <http://localhost:1313/>
-   Build static pages
    -   `hugo -D`
    -   in `./public/` directory by default


## Resources {#resources}

The best resource I could find by far is the work of [Jethro Kuan]({{< relref "20210604133348-jethro_kuan.md" >}}) on

-   <https://github.com/jethrokuan/braindump>
-   <https://github.com/jethrokuan/cortex>
